{
    "job_id": "23221523",
    "company_name": "Abrams Fensterman, LLP",
    "title": "Senior Elder Law / Trusts and Estates Associate Attorney",
    "description": "Senior Associate Attorney - Elder Law / Trusts and Estates  Our legal team is committed to providing each client with quality counsel, innovative solutions, and personalized service. Founded in 2000, the firm offers the legal expertise of its 115+ attorneys, who have accumulated experience and problem-solving skills over decades of practice.\nWe are a prominent Lake Success Law Firm seeking an associate attorney for its growing Elder Law and Estate Planning practice. The successful candidate will be a self-motivated, detail-oriented team member with strong communication skills and a desire to grow their practice. Experience with Estate Planning, Administration, and Litigation and is preferred.\n Responsibilities will include:\nCounseling clients with regard to estate planning and asset protection;Formulating and overseeing execution of Medicaid and estate plans;Drafting wills, revocable and irrevocable trusts, powers of attorney, health care proxies, and living wills;Estate Administration;Trust Administration;Court Appearances for Estate and Proceedings;Supervising paralegals \nQualifications:Juris Doctor degree (J.D.) from an accredited law schoolLicensed to practice law in New York10-15 years of experienceExperience with various advance directives, trusts, and willsStrong analytical and problem-solving skillsAbility to build rapport with clientsExcellent written and verbal communication skills\n Competitive salary commensurate with experienceSalary: $140,000- $175,000Benefits: 401k, Medical, Dental, Life Insurance, PTO, and more\nThis position is based out of Lake Success, NY ",
    "max_salary": "175000.0",
    "pay_period": "YEARLY",
    "location": "New Hyde Park, NY",
    "company_id": "766262.0",
    "views": "16.0",
    "med_salary": "",
    "min_salary": "140000.0",
    "formatted_work_type": "Full-time",
    "applies": "",
    "original_listed_time": "1712895812000.0",
    "remote_allowed": "",
    "job_posting_url": "https://www.linkedin.com/jobs/view/23221523/?trk=jobs_biz_prem_srch",
    "application_url": "",
    "application_type": "ComplexOnsiteApply",
    "expiry": "1715487812000.0",
    "closed_time": "",
    "formatted_experience_level": "",
    "skills_desc": "This position requires a baseline understanding of online marketing including Search Engine Marketing, Search Engine Optimization, and campaign analytics. The ideal candidate must be an analytical and detailed dynamic, self-starter who is proactive, and able to multitask effectively. This individual must be a strategic thinker with excellent verbal and written communication, as well strong presentation skills and the ability to work independently in an organized manner.",
    "listed_time": "1712895812000.0",
    "posting_domain": "",
    "sponsored": "0",
    "work_type": "FULL_TIME",
    "currency": "USD",
    "compensation_type": "BASE_SALARY",
    "normalized_salary": "157500.0",
    "zip_code": "11040",
    "fips": "36059"
}