{
    "job_id": "1218575",
    "company_name": "Children's Nebraska",
    "title": "Respiratory Therapist",
    "description": "At Children’s, the region’s only full-service pediatric healthcare center, our people make us the very best for kids. Come cultivate your passion, purpose and professional development in an environment of excellence and inclusion, where team members are supported and deeply valued. Opportunities for career growth abound as we grow our services and spaces, including the cutting-edge Hubbard Center for Children. Join our highly engaged, caring team—and join us in providing brighter, healthier tomorrows for the children we serve. Children's is committed to diversity and inclusion. We are an equal opportunity employer including veterans and people with disabilities.\nA Brief OverviewProvides appropriate respiratory care specific to the pediatric population in accordance with the hospital policy/procedure. Assesses, plans and implements appropriate respiratory plan of care based on the cardiopulmonary needs of the patients. Evaluates effectiveness of plan of care and recommends revisions to the multidisciplinary care team\nEssential Functions• Set up and operate devices such as mechanical ventilators, therapeutic gas administration apparatus, environmental control systems, and aerosol generators, following specified parameters of treatment. • Determine requirements for treatment, such as type, methods and duration of therapy, precautions to be taken, and medication and dosages, compatible with physician’s orders. • Read physicians’ orders, measure arterial blood gases, and review patient information to assess patient’s condition. • Explain treatment procedures to patients to gain cooperation and allay fears. • Monitor patient’s physiological responses to therapy such as vital signs, arterial blood gases and blood chemistry changes and consult with physician if adverse reactions occur. • Administer therapeutic gases including nitrogen, nitric oxide, heliox, etc. • Enforce safety rules and ensure careful adherence to physicians’ orders. • Maintain charts that contain patient pertinent identification and therapy information. • Inspect, clean, test, and maintain respiratory therapy equipment to ensure equipment is functioning safely and efficiently and notify manager/supervisor when repairs are necessary. • Educate patients and/or their families about the patient’s condition and teach appropriate disease management techniques such as breathing exercises and the use of medications and respiratory equipment. • Perform broncho-pulmonary drainage and assist or instruct patients in performance of breathing exercises. • Conduct lung capacity tests to evaluate patient’s cardiopulmonary functions. • Provide emergency care, including artificial respiration, external cardiac massage and assistance with cardiopulmonary resuscitation. • Complete all required respiratory therapy competency tests within specified timeline. • Demonstrate competency in identified technical skills for the respiratory department at the specific work area.Other duties may also include Clinical Instructor (schedule dependent on the contract with Respiratory Therapy schools): • Supervise contracted Respiratory Therapy (RT) students from specified schools in the clinical hospital setting. • Orients RT students to their role in the hospital, which includes scope of service, policies and procedures, patient safety, and professionalism. • Orients RT students to the equipment used by RT at Children’s. • Provides opportunities for directly supervised hands on learning in the clinical setting. • Responsible for accurate completion and documentation of all Respiratory Therapy performed with RT students. • Responsible for accurate “Hand off” of patient information and ordered Respiratory Therapy performed with RT students.Regular attendance at work is an essential function of the job.Perform physical requirements as described in the Physical Requirements section\nEducation QualificationsGraduate of an accredited AMA approved school of respiratory care accredited by the National Board of Respiratory Care Required andBachelor's Degree From an AMA approved accredited school in respiratory care PreferredExperience QualificationsMinimum 1 year experience in respiratory therapy Preferred andExperience working with pediatric patients PreferredSkills and AbilitiesDemonstrates competency in technical skills related to the Respiratory Therapy department.Licenses and CertificationsRCP - Licensed Respiratory Care Practitioner Current and valid Nebraska license as a Respiratory Care Practitioner Required andBCLS - Basic Life Support through the American Heart Association Required andRRT - Registered Respiratory Therapist Current and valid National Registered Respiratory Therapist (RRT) credential within 1 Year Required andCurrent and valid National Registered Neonatal/Pediatric Respiratory Therapist (RRT-NPS) credential within three years of hire. Required andPALS - Pediatric Advanced Life Support within 180 Days Required\nChildren’s is the very best for kids and the very best for your career! At Children’s, we put YOU first so together, we can improve the life of every child!",
    "max_salary": "",
    "pay_period": "",
    "location": "Omaha, NE",
    "company_id": "721189.0",
    "views": "3.0",
    "med_salary": "",
    "min_salary": "",
    "formatted_work_type": "Full-time",
    "applies": "",
    "original_listed_time": "1712348500000.0",
    "remote_allowed": "",
    "job_posting_url": "https://www.linkedin.com/jobs/view/1218575/?trk=jobs_biz_prem_srch",
    "application_url": "www.childrensnebraska.org",
    "application_type": "OffsiteApply",
    "expiry": "1714940500000.0",
    "closed_time": "",
    "formatted_experience_level": "",
    "skills_desc": "• Requires the ability to communicate effective, both verbally and in writing • Requires basic computer skills \n\nEDUCATION AND EXPERIENCE: \n\n• Graduate of an accredited school of occupational therapy • Must possess current valid Nebraska State License in Occupational Therapy • Must possess current valid registration by the NBCOT ( National Board for Certification in Occupational Therapy) • Must be certified in Basic Life Support • Experience with pediatric patients preferred",
    "listed_time": "1712348500000.0",
    "posting_domain": "",
    "sponsored": "0",
    "work_type": "FULL_TIME",
    "currency": "",
    "compensation_type": "",
    "normalized_salary": "",
    "zip_code": "68102",
    "fips": "31055"
}